"use strict"

var buyerBusM = {}

wrapperM.content.load("pages/buyerBus.html", function() {
    buyerBusM.load();
});

buyerBusM.load = function() {
    buyerBusM.loadComponent();
    buyerBusM.loadBind();
};

buyerBusM.loadComponent = function() {
    buyerBusM.loadTable();
    $("#buyer-bus-table_wrapper > div:nth-child(1) > div:nth-child(1)").load("pages/buyerBusTableBtn.html", function(){
        $("#buyer-bus-add-dialog").load("pages/buyerBusAdd.html", function(){
            wrapperM.subDfrd.resolve();
        });
    });
};

buyerBusM.loadTable = function() {
    var data = [
        ["01"," ", "2020-08-13<br>15:34:00", "已照會", "呂1", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:34:00"],
        ["02"," ", "2020-08-13<br>15:33:00", "已照會", "呂2", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:33:00"],
        ["03"," ", "2020-08-13<br>15:32:00", "已照會", "呂3", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:32:00"],
        ["04"," ", "2020-08-13<br>15:31:00", "已照會", "呂4", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:31:00"],
        ["05"," ", "2020-08-13<br>15:30:00", "已照會", "呂5", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:30:00"],
        ["06"," ", "2020-08-13<br>15:29:00", "已照會", "呂6", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:29:00"],
        ["07"," ", "2020-08-13<br>15:28:00", "已照會", "呂7", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:28:00"],
        ["08"," ", "2020-08-13<br>15:27:00", "已照會", "呂8", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:27:00"],
        ["09"," ", "2020-08-13<br>15:26:00", "已照會", "呂9", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:26:00"],
        ["10"," ", "2020-08-13<br>15:25:00", "已照會", "呂10", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:25:00"],
        ["11"," ", "2020-08-13<br>15:24:00", "已照會", "呂11", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:24:00"],
        ["12"," ", "2020-08-13<br>15:23:00", "已照會", "呂12", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:23:00"],
        ["13"," ", "2020-08-13<br>15:22:00", "已照會", "呂13", "已聯絡<br>0989522767", "餐飲小吃", "新北市淡水區", "$30萬~50萬等"," "," ", "Teresa", "2020-08-13<br>15:22:00"]
    ];
    $("#buyer-bus-table").DataTable({
        "responsive": true,
        "lengthChange": false,
        "autoWidth": true,
        "pageLength": 10,
        "scrollY": "calc(100vh - calc(3.5rem + 1px) - calc(3.5rem + 1px) - calc(10.5rem + 2px) - calc(2.3125rem + 18px) - calc(2.25rem + 5.2px) - calc(2.25rem + 3.2px))",
        "columnDefs": [
            {
                "targets": 0,
                "title": "排序"
            },
            {
                "targets": 1,
                "title": "操作"
            },
            {
                "targets": 2,
                "title": "刊登時間"
            },
            {
                "targets": 3,
                "title": "照會"
            },
            {
                "targets": 4,
                "title": "姓名"
            },
            {
                "targets": 5,
                "title": "電話"
            },
            {
                "targets": 6,
                "title": "類別"
            },
            {
                "targets": 7,
                "title": "縣市"
            },
            {
                "targets": 8,
                "title": "頂讓金"
            },
            {
                "targets": 9,
                "title": "租金"
            },
            {
                "targets": 10,
                "title": "評數"
            },
            {
                "targets": 11,
                "title": "負責專員"
            },
            {
                "targets": 12,
                "title": "最後修改"
            }
        ],
        "data": data
    });
};

buyerBusM.loadBind = function () {

};