"use strict"

var itemsM = {}

wrapperM.content.load("pages/items.html", function() {
    itemsM.load();
});

itemsM.load = function() {
    itemsM.loadComponent();
    itemsM.loadBind();
};

itemsM.loadComponent = function() {
    itemsM.loadTable();
    $("#items-table_wrapper > div:nth-child(1) > div:nth-child(1)").load("pages/itemsTableBtn.html", function(){
        $("#items-add-dialog").load("pages/itemsAdd.html", function(){
            wrapperM.subDfrd.resolve();
        });
    });
};

itemsM.loadTable = function() {
    var data = [
        ["01"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["02"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["03"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["04"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["05"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["06"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["07"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["08"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["09"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["10"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["11"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["12"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
        ["13"," ", "S12345678", "U12345678", "2020-08-13<br>15:34:00", "一級戰區", "台中市大里區", "餐飲小吃", "關閉中", "0", "急讓(0)<br>置頂(0)<br>精選(0)<br>首頁(0)", "2020-08-13<br>15:34:00", "2020-08-13<br>15:34:00", 0, 0, 0],
    ];
    $("#items-table").DataTable({
        "responsive": true,
        "lengthChange": false,
        "autoWidth": true,
        "pageLength": 10,
        "scrollY": "calc(100vh - calc(3.5rem + 1px) - calc(3.5rem + 1px) - calc(10.5rem + 2px) - calc(2.3125rem + 18px) - calc(2.25rem + 5.2px) - calc(2.25rem + 3.2px))",
        "columnDefs": [
            {
                "targets": 0,
                "title": "排序"
            },
            {
                "targets": 1,
                "title": "操作"
            },
            {
                "targets": 2,
                "title": "物件編號"
            },
            {
                "targets": 3,
                "title": "會員編號"
            },
            {
                "targets": 4,
                "title": "修改日期"
            },
            {
                "targets": 5,
                "title": "名稱"
            },
            {
                "targets": 6,
                "title": "縣市地區"
            },
            {
                "targets": 7,
                "title": "類別"
            },
            {
                "targets": 8,
                "title": "狀態"
            },
            {
                "targets": 9,
                "title": "刊登天數"
            },
            {
                "targets": 10,
                "title": "標籤"
            },
            {
                "targets": 11,
                "title": "更新日期"
            },
            {
                "targets": 12,
                "title": "建立日期"
            },
            {
                "targets": 13,
                "title": "人氣"
            },
            {
                "targets": 14,
                "title": "收藏"
            },
            {
                "targets": 15,
                "title": "問答"
            }
        ],
        "data": data
    });
};


itemsM.loadBind = function () {

};